БухЭксп/InformationRegisters/CW_РегистрацонныеЗнакиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РегистрацонныеЗнакиАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_РегистрацонныеЗнакиАвтомобилей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрационныйЗнак = Запись.РегистрационныйЗнак;
	
	Если Не Запись.РегистрационныйЗнак_Произвольный Тогда
		
		НомерКорректен  			= ПровериьДанные(Запись.РегистрационныйЗнак_Номер	, Истина);
		РегионКорректен 			= ПровериьДанные(Запись.РегистрационныйЗнак_Регион	, ложь);
		
		ОбновитьЦветТекста();
		
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.РегистрационныйЗнак_Номер.Видимость	= Не Запись.РегистрационныйЗнак_Произвольный;
	Элементы.РегистрационныйЗнак_Регион.Видимость	= Не Запись.РегистрационныйЗнак_Произвольный;
	
	Элементы.РегистрационныйЗнак.Видимость 			= Запись.РегистрационныйЗнак_Произвольный;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	Если Запись.РегистрационныйЗнак_Произвольный тогда
		Запись.РегистрационныйЗнак_Регион	= "";
		Запись.РегистрационныйЗнак_Номер	= "";
		ЗаписьРегистрационныйЗнак 			= ВРЕГ(РегистрационныйЗнак);
	Иначе	
		ЗаписьРегистрационныйЗнак 	= ВРЕГ(СокрЛП(Запись.РегистрационныйЗнак_Номер)+СокрЛП(Запись.РегистрационныйЗнак_Регион));
	КонецЕсли;
	
	Запись.РегистрационныйЗнак 			= ЗаписьРегистрационныйЗнак;
	Запись.РегистрационныйЗнак_Номер 	= ВРЕГ(Запись.РегистрационныйЗнак_Номер);
	Запись.РегистрационныйЗнак_Регион 	= ВРЕГ(Запись.РегистрационныйЗнак_Регион);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Функция ПровериьДанные(Текст, Флаг)
	 Возврат  Справочники.CW_ТранспортныеСредства.ПроверитьКорректностьНомера(Текст, Флаг);
 КонецФункции
 
&НаСервере
Процедура ОбновитьЦветТекста()
	
	Элементы.РегистрационныйЗнак_Номер.ЦветТекста 	= ?(НомерКорректен	, новый Цвет, ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элементы.РегистрационныйЗнак_Регион.ЦветТекста 	= ?(РегионКорректен	, новый Цвет, ЦветаСтиля.ЦветОтрицательногоЧисла);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйЗнак_НомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка 				= Ложь;
	Запись.РегистрационныйЗнак_Номер 	= Текст;
	НомерКорректен 						= ПровериьДанные(Текст, истина);
	
	ОбновитьЦветТекста();

КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйЗнак_РегионОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка 				= Ложь;
	Запись.РегистрационныйЗнак_Регион 	= Текст;
	РегионКорректен 					= ПровериьДанные(Текст, ложь);
	
	ОбновитьЦветТекста();
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйЗнак_ПроизвольныйПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьРегистрационныеНомера");
	
КонецПроцедуры
